Repository: DerrickCGT/AstroClient
Catalog: AstroClient/AstroForm.*.resx
Languages: fr_fr

# textBoxObservedWavelength.ToolTip
source: Enter the observed wavelength of the star's light in meters.
fr_fr: Entrez la longueur d'onde observée de la lumière de l'étoile en mètres.

# textBoxRestWavelength.ToolTip
source: Enter the rest wavelength of the star's light in meters.
fr_fr: Entrez la longueur d'onde de repos de la lumière de l'étoile en mètres.

# textBoxParallaxAngle.ToolTip
source: Enter the parallax angle of the star in arc seconds to calculate its distance.
fr_fr: Entrez l'angle de parallaxe de l'étoile en secondes d'arc pour calculer sa distance.

# textBoxCelcius.ToolTip
source: Enter the temperature in degrees Celsius for conversion to Kelvin. (Not applicable for less than 273 Celcius.
fr_fr: Entrez la température en degrés Celsius pour la conversion en Kelvin.

# textBoxMassExponent.ToolTip
source: Enter the exponent for the power of 10 (e.g., for 10^6, enter 6) to calculate the event horizon
fr_fr: Entrez l'exposant de la puissance de 10 (par exemple, pour 10^6, entrez 6) pour calculer l'horizon des événements.

# textBoxMassOfStar.ToolTip
source: Enter the mass of the star.
fr_fr: Entrez la masse de l'étoile en kilogrammes

# groupBoxLanguage.Text
source: Language
fr_fr: Langue

# groupBox1.Text
source: Colour Theme
fr_fr: Thème de Couleur

# buttonDarkMode.Text
source: Dark
fr_fr: Sombre

# buttonLightMode.Text
source: Light
fr_fr: Clair
